handouts/lecture_notes/lecture_7/warmup_0401.tex
% Created 2017-03-31 Fri 20:55
% Intended LaTeX compiler: pdflatex
\documentclass[presentation,10pt]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usetheme{CambridgeUS}
\usecolortheme{beaver}
\author{Zheng Tian}
\date{\textit{[2017-04-01 Sat]}}
\title{Warm-up Exercises}
\hypersetup{
 pdfauthor={Zheng Tian},
 pdftitle={Warm-up Exercises},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 9.0.3)}, 
 pdflang={English}}
\begin{document}

\maketitle


\begin{frame}[label={sec:org34239a5}]{Question 1}
In the simple linear regression model \(Y_{i} = \beta_0 + \beta_1 X_1 + u_i\),

\begin{description}
\item[{A}] the intercept is typically small and unimportant.
\item[{B}] \(\beta_0 + \beta_1 X_1\) represents the population regression function.
\item[{C}] the absolute value of the slope is typically between 0 and 1.
\item[{D}] \(\beta_0 + \beta_1 X_1\) represents the sample regression function.
\end{description}

\pause
\alert{Answer: B}
\pause
\end{frame}

\begin{frame}[label={sec:orgd495f21}]{Question 2}
The OLS estimator is derived by

\begin{description}
\item[{A}] connecting the \(Y_i\) corresponding to the lowest \(X_i\) observation with the \(Y_i\) corresponding to the highest \(X_i\) observation.
\item[{B}] making sure that the standard error of the regression equals the standard error of the slope estimator.
\item[{C}] minimizing the sum of absolute residuals.
\item[{D}] minimizing the sum of squared residuals.
\end{description}

\pause
\alert{Answer: D}
\pause
\end{frame}

\begin{frame}[label={sec:org2e18989}]{Question 3}
The following are all least squares assumptions with the exception of:

\begin{description}
\item[{A}] The conditional distribution of \(u_i\) given \(X_i\) has a mean of zero.
\item[{B}] The explanatory variable in regression model is normally distributed.
\item[{C}] \((X_i, Y_i), i=1, \ldots, n\) are independently and identically distributed.
\item[{D}] Large outliers are unlikely.
\end{description}

\pause
\alert{Answer: B}
\end{frame}
\end{document}